EMOJI_CATEGORIES = {
        'love': ['❤️', '❤', '💖', '💕', '❣️', '💘'],
        'laugh': ['😂', '🤣', '😹', '😆', '😁', '😜'],
        'agree': ['👍', '👏', '🙌', '💪', '👌', '🙏'],
        'negative': ['😢', '😭', '🥺', '😞', '😔', '😡', '😠', '🤬', '🤮', '💔'],
        'hype': ['🔥', '🤯', '🤩', '💥', '🎉', '💯'],
        'impress': ['👑', '🎯', '🧿'],
        'fun': ['💃', '🧚‍♂️']
    }

COLORS = {
        'love': '#e6194b',
        'laugh': '#ffa600',
        'agree': '#2ca02c',
        'negative': '#1f77b4',
        'hype': '#9c27b0',
        'impress': '#f781bf',
        'fun': '#00bcd4',
        'messages': '#CCCCCC',
        'replies': '#1f77b4',
        'other': '#1f11b4',
        'emoji_total': '#b2df8a',
        'emoji_and_messages': '#b2df8a',
        'replies_in_emoji_and_messages': '#1f77b4',
        'emoji_in_emoji_and_messages': '#00bcd4'
    }

GROUP_PARTICIPANTS = {
        'מדמח העברית - שנתון תשפה': 450,
        'CS2024': 547, 'מדמח העברית - שנתון תשפג': 612,
        'קידר - תושבים': 645,
        'מחט בערימה של דאטה - קבוצת קורס': 204,
        'ניידל-פרויקט': 3,
        'TBirds XC': 10,
        'גמורים-קבוצת חברים': 6,
        'ישראלים ב-UBC': 6,
        'לוחמי האקווריום 🔥🥷': 312,
        'ועד האתלטים בישראל': 320,
        'מבוא לבקרה עם למידה - 67678': 67,
        'מבוא ללמידת מכונה IML 67577': 391
    }